app/controllers/pages_controller.rb

  def index
    @pages = Page.all
    @client_ip = request.remote_ip
    @remote_ip = request.env["HTTP_X_FORWARDED_FOR"]
    @my_ip     = request.env["HTTP_X_FORWARDED_FOR"] || request.remote_addr
    @ip_addr   = request.env['REMOTE_ADDR']
    @liveacces = Live.where(ip: @my_ip).where(access: 1)
---
SELECT `pages`.* FROM `pages`
SELECT `lives`.* FROM `lives` WHERE `lives`.`ip` = '127.0.0.1' AND `lives`.`access` = 1

  def show
    @client_ip = request.remote_ip
    @remote_ip = request.env["HTTP_X_FORWARDED_FOR"]
    @my_ip     = request.env["HTTP_X_FORWARDED_FOR"] || request.remote_addr
    @ip_addr   = request.env['REMOTE_ADDR']
    @liveacces = Live.where(ip: @my_ip).where(access: 1)
    @liveAccess = false
      @liveacces.each do |l|
      @liveAccess = true
    end
    @page = Page.find(params[:id])
---
SELECT `lives`.* FROM `lives` WHERE `lives`.`ip` = '127.0.0.1' AND `lives`.`access` = 1
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "2"]]

  def mercury_update
    page = Page.find(params[:id])
    page.name = params[:content][:page_name][:value]
    page.content = params[:content][:page_content][:value]
    page.save!
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE `pages` SET `name` = 'Weme', `content` = '<p>In this RailsCasts episode we are going to look at the <a href=\"http://jejacks0n.github.com/mercury/\">Mercury Editor</a>. It allows you to edit a document in-place, right in the HTML. It works in the following browsers.</p>\n<ul>\n <li>Firefox 4+</li>\n <li>Chrome 10+</li>\n <li>Safari 5+</li>\n</ul>\n<p>Try it out here by clicking on the <strong><em>Edit Page</em></strong> link below. There you will be able to change this page content and even the title above.</p>', `updated_at` = '2012-02-17 07:42:53' WHERE `pages`.`id` = 1